[
  {
    "id": 1,
    "title": "Il est possible de connaître les nouveaux contenus ou services",
    "authors": ["Marco BARONI"],
    "path": "/rules/1",
    "description": "Une image vaut souvent mieux qu’un long discours. Certes, mais tout d’abord, il peut s’avérer difficile de véritablement comprendre un graphique (courbe, diagramme, histogramme, camembert...) si l’on n'a pas les données qui ont permis de le créer. D’autre part, certains utilisateurs ne pourront pas avoir accès au rendu graphique, et l’accès aux données leur permettra de comprendre les contenus.",
    "tags": [
      "Accessibilité",
      "Conception",
      "Contenus",
      "Éditorial",
      "SEO",
      "Écoconception"
    ],
    "objectives": [
      "Permettre aux utilisateurs d'identifier immédiatement les nouveaux contenus ou services en ligne.",
      "Améliorer la prise en compte des contenus par les moteurs de recherche et outils d’indexation."
    ],
    "implementationIntro": "À titre d'exemple, les différentes solutions ci-dessous peuvent être déployées seules ou conjointement :",
    "implementation": [
      "Publier un flux RSS des actualités du site.",
      "Publier une rubrique du type « Actualités du site » ou « Quoi de neuf ? »",
      "Indiquer un compte de réseau social ou un canal d'actualité où sont publiées les actualités concernant le site."
    ],
    "control": [
      "Vérifier qu’un canal interne existe (flux RSS, rubrique « Quoi de neuf ? », etc.).",
      "Vérifier qu’un canal externe est accessible depuis la page d’accueil (si utilisé)."
    ],
    "screenshotsSources": [
      "https://www.service-public.fr/",
      "https://www.nuxt.com/blog",
      "https://developer.mozilla.org/fr/"
    ]
  },
  {
    "id": 2,
    "title": "Les informations importantes sont accessibles et compréhensibles",
    "path": "/rules/2",
    "tags": [
      "Accessibilité",
      "Conception",
      "Contenus",
      "Éditorial",
      "UX",
      "SEO"
    ],
    "objective": "Assurer que les informations essentielles sont facilement accessibles et compréhensibles pour tous les utilisateurs, y compris ceux ayant des besoins spécifiques."
  },
  {
    "id": 10,
    "title": "Les contenus ou fichiers destinés à des espaces publics peuvent être vérifiés avant leur envoi définitif.",
    "authors": ["Marco BARONI"],
    "path": "/rules/10",
    "description": "Il est fort agaçant de voir publier un message sous une forme dégradée ou de constater après envoi que l’on a écrit une grosse bêtise. La prévisualisation permet de voir les contenus en contexte et donne la possibilité de les corriger ou de les peaufiner.",
    "tags": ["Contenus", "Développement"],
    "objectives": [
      "Permettre à l’utilisateur de vérifier sa saisie en contexte et, si nécessaire, de la corriger avant envoi.",
      "Diminuer le nombre de demandes de rectification ou de suppression."
    ],
    "implementationIntro": "Mettre en place une prévisualisation des informations saisies avant la soumission définitive du formulaire, avec possibilité de les modifier.",
    "implementation": [],
    "control": [
      "Pour chaque espace public du site (zone de commentaire, forum, page personnelle publique, avatar, portfolio de documents, etc.) :",
      "Saisir des informations destinées à être rendues publiques telles que des images associées à un compte ou un commentaire.",
      "Vérifier que la soumission définitive du formulaire de saisie est précédée d'une étape permettant, si l'utilisateur le souhaite, de contrôler et de modifier le résultat de sa saisie avant publication."
    ],
    "screenshotsSources": [
      "https://www.gmail.com/",
      "https://www.nuxt.com/blog",
      "https://developer.mozilla.org/fr/"
    ]
  },
  {
    "id": 87,
    "title": "Les processus complexes sont accompagnés de la liste de leurs étapes.",
    "authors": ["Adrien LECOMTE"],
    "path": "/rules/87",
    "description": "Il est toujours appréciable de connaître à l’avance le nombre d’étapes et de pouvoir estimer le temps nécessaire pour réaliser une longue démarche",
    "tags": ["Basics", "Accessibilité", "Conception", "Formulaires"],
    "objectives": [
      "Donner de la visibilité à l'utilisateur sur les actions qu'il va réaliser (ordre des étapes, informations nécessaires pour les accomplir, etc.). ",
      "Éviter que l'utilisateur ne se sente piégé dans un processus dont il n'avait pas prévu la durée."
    ],
    "implementationIntro": "Pour tout processus complexe, par exemple un formulaire de commande, afficher à chaque étape la liste intégrale de toutes ses étapes.",
    "implementation": [],
    "control": [
      "Vérifier, pour chaque page concernée, que la liste des étapes y est indiquée, en règle générale sous forme d'un chemin d'étapes en tête de page ou de formulaire."
    ],
    "screenshotsSources": []
  },
  {
    "id": 88,
    "title": "L'étape en cours d'un processus complexe est indiquée.",
    "authors": ["Adrien LECOMTE"],
    "path": "/rules/88",
    "description": "Ne vous êtes-vous jamais demandé, au beau milieu d’une démarche un peu longue répartie sur plusieurs formulaires successifs, où vous étiez exactement ?",
    "tags": ["Accessibilité", "Conception", "Formulaires"],
    "objectives": [
      "Permettre à l'utilisateur d'identifier le degré d'avancement dans un processus.",
      "Rassurer l'utilisateur lors de la réalisation d'un processus complexe."
    ],
    "implementationIntro": "Préciser sur chaque page du processus l'étape correspondant à la page en cours.",
    "implementation": [],
    "control": [
      "Dans le cas de processus complexes, vérifier, pour chaque page concernée, que l'étape en cours y est indiquée",
      "Dans le titre de page",
      "Dans le contenu de page, sous la forme d'une mise en évidence dans le chemin d'étapes en tête de page ou de formulaire, par exemple « Étape 2 – Coordonnées » ou « Étape 4 – Paiement »."
    ],
    "screenshotsSources": []
  },
  {
    "id": 89,
    "title": "Chaque étape d'un processus complexe permet de revenir à l'étape précédente.",
    "authors": ["Adrien LECOMTE"],
    "path": "/rules/89",
    "description": "Après avoir décidé de passer à l’étape suivante d’un processus complexe, il arrive souvent d’avoir besoin de vérifier ce qu’on a saisi précédemment. Laissez aux internautes la possibilité de douter, de vérifier, et de se tromper, bien sûr.",
    "tags": ["Accessibilité","Développement", "Conception", "Formulaires"],
    "objectives": [
      "Faciliter l’utilisation des formulaires répartis sur plusieurs pages successives.",
      "Réduire les risques d’erreurs de saisie. Limiter les risques d’abandon en cours de processus."
    ],
    "implementationIntro": "Fournir à chaque étape du formulaire un bouton de navigation permettant de retourner à l’étape précédente.",
    "implementation": [],
    "control": [
      "Vérifier manuellement la possibilité de revenir à chaque étape précédente du processus."
    ],
    "screenshotsSources": []
  },
  {
    "id": 90,
    "title": "L'utilisateur est averti de la perte d'information en cas d'utilisation de l'historique de son navigateur dans un processus complexe.",
    "authors": ["Adrien LECOMTE"],
    "path": "/rules/90",
    "description": "Ne vous est-il jamais arrivé de croire que vous pouviez tout simplement retourner voir ce que vous aviez saisi à l’étape précédente lors de votre déclaration d’impôts, par exemple, et de constater peu après que tout ce que vous aviez saisi avant ce remords était perdu ? Évitons ce genre de déception à nos utilisateurs.",
    "tags": ["Basics", "Accessibilité", "Conception","Développement", "Formulaires"],
    "objectives": [
      "Faciliter l’utilisation des formulaires répartis sur plusieurs pages successives.",
      "Limiter les risques d’abandon en cours de processus."
    ],
    "implementationIntro": "Générer une alerte JavaScript en cas de l’utilisation de la fonctionnalité « back » de l’historique du navigateur. ",
    "implementation": [],
    "control": [
      "Amorcer la saisie d’un formulaire après la première étape du processus, puis activer le bouton « back » du navigateur."
    ],
    "screenshotsSources": []
  },
  {
    "id": 91,
    "title": "La navigation dans un processus complexe ne provoque pas la perte des données précédemment soumises.",
    "authors": ["Adrien LECOMTE"],
    "path": "/rules/91",
    "description": "Il est certes extrêmement confortable pour l’utilisateur de pouvoir naviguer dans les différentes étapes d’un processus complexe. Il est évidemment essentiel de l’avertir lorsque des données peuvent être perdues. C’est d’ailleurs l’objet d’une autre des règles assurance qualité web. Il est encore plus utile de s’assurer que l’ensemble des données saisies par l’utilisateur sont enregistrées à tout moment.",
    "tags": ["Développement", "Formulaires"],
    "objectives": [
      "Faciliter la saisie et sa correction dans les formulaires répartis par étapes.",
      "Limiter les risques d’abandon en cours de procédure."
    ],
    "implementationIntro": "Prévoir, au niveau de la gestion de la navigation dans les étapes du processus, l’enregistrement des données saisies à chaque étape, de manière à pouvoir afficher à nouveau celle-ci sans perte de données après que l’utilisateur a utilisé le mécanisme de navigation dans les étap",
    "implementation": [],
    "control": [
      "Utiliser le mécanisme de navigation dans les étapes précédentes de la saisie et vérifier manuellement que les données saisies à chaque étape sont conservées et affichées à nouveau par la suite. "
    ],
    "screenshotsSources": []
  },
  {
    "id": 92,
    "title": "Le copier coller est possible dans les champs de formulaire.",
    "authors": ["Adrien LECOMTE"],
    "path": "/rules/92",
    "description": "Saisissez votre adresse e-mail. C’est bon, c’est fait ? Et si maintenant je vous demande de la saisir de nouveau, vous allez peut-être avoir la flemme de le faire et voudrez la copier depuis le premier champ pour la coller dans le deuxième. De quel droit certains sites voudraient-ils vous empêcher de faire cela ? Vive le copier-coller libre !",
    "tags": ["Basics", "Accessibilité", "Développement", "Formulaires"],
    "objectives": [
      "Faciliter la saisie dans les formulaires."
    ],
    "implementationIntro": "",
    "implementation": [
      "Ne pas intercepter les événements JavaScript onpaste ou keydown pour bloquer le coller dans un champ de formulaire.",
      "Ne pas intercepter les événements JavaScript oncopy ou oncut pour bloquer le copier dans un champ de formulaire."
    ],
    "control": [
      "Vérifier qu’il est possible de copier le contenu de chaque champ y compris les champs de type password (en utilisant le menu contextuel du navigateur ou à défaut un mécanisme propre au formulaire).",
      "Vérifier qu’il est possible de coller un contenu dans chaque champ y compris dans les champs de type password (en utilisant le menu contextuel du navigateur ou à défaut un mécanisme propre au formulaire)."
    ],
    "screenshotsSources": []
  },
  {
    "id": 93,
    "title": "Les éléments d'une liste déroulante qui peuvent être regroupés le sont de manière appropriée.",
    "authors": ["Adrien LECOMTE"],
    "path": "/rules/93",
    "description": "Le contenu de certaines listes déroulantes est suffisamment homogène pour se suffire à lui-même, mais, dans certains cas, la liste sera plus aisée à consulter en étant mieux organisée. Dans ce cas, l’élément optgroup est votre ami.",
    "tags": ["Basics", "Accessibilité", "Conception", "Formulaires"],
    "objectives": [
      "Permettre aux aides techniques de restituer à l’utilisateur une liste dont l’organisation est clairement perceptible et qui facilite le passage d’un élément de la liste à un autre.",
      "Favoriser un rendu approprié des listes déroulantes complexes dans tous les navigateurs.",
      "Améliorer l’accessibilité des contenus aux personnes handicapées"
    ],
    "implementationIntro": "",
    "implementation": [
      "Utiliser l'élément optgroup pour baliser les regroupements thématiques d'éléments option dans les listes sel",
      "Utiliser l'attribut label de l'élément optgroup pour afficher l'étiquette de chaque regroupement."
    ],
    "control": [
      "Ouvrir chaque liste (select) pour détecter celles qui nécessiteraient un regroupement d'éléments option, par exemple des regroupements de modèles de voitures classés par marques ou des regroupements de villes réalisés par département ",
      "Vérifier, en examinant le code source à l'aide de Firebug, que chaque série d'éléments option qui devraient être regroupés est balisée avec l'élément optgroup",
      "Vérifier que chaque élément optgroup est doté d'un attribut label associant un libellé pertinent au groupe d'options concern"
    ],
    "screenshotsSources": []
  },






    {
      "id": 160,
      "title": "Les mécanismes de fermeture de fenêtres sont visuellement rattachés à leur contenu",
      "authors": ["Bastien JOUFFRE"],
      "path": "/rules/160",
      "description": "Les boutons de fermeture des fenêtres modales ou similaires doivent être placés dans le bloc visuel de la fenêtre afin d’être clairement associés au contenu qu’ils ferment.",
      "tags": ["Accessibilité", "Conception", "Navigation"],
      "objectives": [
        "Limiter le temps d’apprentissage de l’interface.",
        "Accélérer l’accès aux contenus.",
        "Faciliter la navigation."
      ],
      "implementation": [
        "Positionner chaque bouton de fermeture dans le bloc visuel de la fenêtre ou de manière contiguë.",
        "Éviter d’afficher le bouton de fermeture dans une zone éloignée du contenu."
      ],
      "control": [
        "Vérifier que chaque bouton de fermeture de fenêtre modale est placé dans le bloc concerné ou immédiatement adjacent."
      ],
      "screenshotsToTake": [
        {
          "description": "Fenêtre modale affichée avec bouton de fermeture logiquement rattaché au contenu.",
          "where": "Interface avec modale ouverte."
        }
      ],
      "screenshotsSources": [
        "https://checklists.opquast.com/fr/qualite-numerique/les-mecanismes-de-fermeture-de-fenetres-sont-visuellement-rattachees-a-leur-contenu"
      ]
    },
    {
      "id": 161,
      "title": "Les mécanismes de fermetures de fenêtres sont immédiatement disponibles",
      "authors": ["Bastien JOUFFRE"],
      "path": "/rules/161",
      "description": "Les fenêtres modales ou similaires doivent pouvoir être fermées immédiatement sans temporisation.",
      "tags": ["Accessibilité", "Conception", "Développement", "Navigation"],
      "objectives": [
        "Limiter le temps d’attente imposé à l’utilisateur.",
        "Accélérer l’accès aux contenus.",
        "Réduire le taux de rebond des utilisateurs."
      ],
      "implementation": [
        "Éviter d’utiliser des temporisations empêchant immédiatement de fermer une fenêtre modale ou similaire."
      ],
      "control": [
        "S’assurer que chaque fenêtre peut être fermée dès son affichage sans délai imposé."
      ],
      "screenshotsToTake": [
        {
          "description": "Fenêtre modale affichée avec bouton de fermeture dès son apparition.",
          "where": "Interface avec modale ouverte."
        }
      ],
      "screenshotsSources": [
        "https://checklists.opquast.com/fr/assurance-qualite-web/les-mecanismes-de-fermetures-de-fenetres-sont-immediatement-disponibles"
      ]
    },
    {
      "id": 162,
      "title": "Les nouvelles fenêtres dimensionnées et les fenêtres modales sont dotées d'un bouton de fermeture explicite",
      "authors": ["Bastien JOUFFRE"],
      "path": "/rules/162",
      "description": "Chaque fenêtre dimensionnée ou fenêtre modale doit proposer un bouton ou un lien de fermeture explicite afin que l’utilisateur sache comment la fermer.",
      "tags": ["Accessibilité", "Conception", "Développement", "Navigation"],
      "objectives": [
        "Donner une indication claire pour fermer chaque fenêtre modale.",
        "Accélérer l’accès aux contenus."
      ],
      "implementation": [
        "Placer un bouton ou un lien de fermeture explicite dans chaque fenêtre modale ou dimensionnée.",
        "Associer ce bouton à une action de fermeture identifiable."
      ],
      "control": [
        "Vérifier que chaque fenêtre modale ou dimensionnée contient un bouton de fermeture explicite compréhensible."
      ],
      "screenshotsToTake": [
        {
          "description": "Modale ou fenêtre dimensionnée avec bouton de fermeture clairement visible.",
          "where": "Fenêtre modale ouverte."
        }
      ],
      "screenshotsSources": [
        "https://checklists.opquast.com/fr/assurance-qualite-web/les-nouvelles-fenetres-dimensionnees-et-les-fenetres-modales-sont-dotees-dun-bouton-de-fermeture-explicite"
      ]
    },
    {
      "id": 163,
      "title": "Les mécanismes de fermetures de fenêtres sont affichés aux mêmes emplacements sur toutes les pages",
      "authors": ["Bastien JOUFFRE"],
      "path": "/rules/163",
      "description": "Les boutons de fermeture des fenêtres modales doivent être placés au même emplacement sur toutes les pages afin de limiter la charge mentale des utilisateurs.",
      "tags": ["Accessibilité", "Conception", "Navigation"],
      "objectives": [
        "Faciliter l’apprentissage de l’interface.",
        "Accélérer l’accès aux contenus."
      ],
      "implementation": [
        "Choisir un emplacement systématique pour les boutons de fermeture sur toutes les pages (par exemple en haut à droite)."
      ],
      "control": [
        "Vérifier visuellement que tous les boutons de fermeture sont affichés au même emplacement sur toutes les pages."
      ],
      "screenshotsToTake": [
        {
          "description": "Screenshots de plusieurs pages montrant la fermeture aux mêmes emplacements.",
          "where": "Exemples de pages avec modales ouvertes."
        }
      ],
      "screenshotsSources": [
        "https://checklists.opquast.com/fr/assurance-qualite-web/les-mecanismes-de-fermetures-de-fenetres-sont-affiches-aux-memes-emplacements-sur-toutes-les-pages"
      ]
    },
    {
      "id": 164,
      "title": "Chaque page contient des liens d’accès rapide placés au début du code source",
      "authors": ["Bastien JOUFFRE"],
      "path": "/rules/164",
      "description": "Pour faciliter la navigation, chaque page doit contenir des liens d’accès rapide en début de code HTML permettant d’atteindre directement les zones principales.",
      "tags": ["Accessibilité", "Conception", "Développement", "Navigation"],
      "objectives": [
        "Permettre aux utilisateurs de sauter rapidement vers les zones principales.",
        "Améliorer la navigation au clavier et l’accessibilité globale."
      ],
      "implementation": [
        "Fournir des liens d’accès rapide vers le menu principal, le contenu principal et le formulaire de recherche si nécessaire, placés en début de code HTML.",
        "Ces liens peuvent être masqués au chargement mais doivent être visibles lors de la première tabulation."
      ],
      "control": [
        "Vérifier la présence des liens d’accès rapide et leur placement en début de code.",
        "Tester qu’ils sont accessibles via tabulation et effectuent la navigation attendue."
      ],
      "screenshotsToTake": [
        {
          "description": "Arborescence du code source avec les liens d’accès rapide en début.",
          "where": "Code HTML d’une page."
        }
      ],
      "screenshotsSources": [
        "https://checklists.opquast.com/fr/assurance-qualite-web/chaque-page-contient-des-liens-dacces-rapide-places-au-debut-du-code-source"
      ]
    },
    {
      "id": 165,
      "title": "Le focus clavier n'est ni supprimé ni masqué",
      "authors": ["Bastien JOUFFRE"],
      "path": "/rules/165",
      "description": "Le focus clavier doit rester visible pour que les utilisateurs puissent voir où se trouve le curseur lors de la navigation au clavier.",
      "tags": ["Accessibilité", "Conception", "Développement", "Navigation"],
      "objectives": [
        "Permettre la navigation au clavier ou via d’autres périphériques d’entrée.",
        "Améliorer l’accessibilité des contenus pour les personnes handicapées."
      ],
      "implementation": [
        "Ne pas supprimer ou masquer l’effet visuel de focus clavier.",
        "Ne pas annuler CSS outline sans alternative visuelle.",
        "Éviter de supprimer la prise de focus via JavaScript."
      ],
      "control": [
        "Utiliser la touche Tab pour vérifier la visibilité du focus sur chaque élément interactif.",
        "Vérifier l’indication visuelle spécifique pour les lecteurs d’écran et autres technologies d’assistance."
      ],
      "screenshotsToTake": [
        {
          "description": "Focus clavier visible sur liens ou champs lors de navigation par tabulation.",
          "where": "Page avec éléments interactifs."
        }
      ],
      "screenshotsSources": [
        "https://checklists.opquast.com/fr/qualite-numerique/le-focus-clavier-nest-ni-supprime-ni-masque"
      ]
    },
    {
      "id": 166,
      "title": "Le site est intégralement utilisable au clavier",
      "authors": ["Bastien JOUFFRE"],
      "path": "/rules/166",
      "description": "La navigation au clavier doit permettre d’interagir avec l’intégralité des contenus et des services du site, sans nécessiter l’usage de la souris.",
      "tags": ["Accessibilité", "Développement", "Navigation"],
      "objectives": [
        "Permettre la consultation et l’usage des services indépendamment du périphérique d’entrée.",
        "Améliorer l’accessibilité des contenus aux personnes handicapées."
      ],
      "implementation": [
        "Utiliser des gestionnaires d’événements permettant l’accès clavier (`onfocus`, etc.).",
        "Assurer que toutes les interactions et formulaires sont accessibles via la touche Tab et autres raccourcis clavier."
      ],
      "control": [
        "Tester la navigation complète du site au clavier, vérifier que tous les éléments interactifs sont accessibles."
      ],
      "screenshotsToTake": [
        {
          "description": "Navigation complète au clavier montrant accès à tous les éléments.",
          "where": "Séquence de navigation par tabulation."
        }
      ],
      "screenshotsSources": [
        "https://checklists.opquast.com/fr/assurance-qualite-web/le-site-est-integralement-utilisable-au-clavier"
      ]
    }
  ]

